In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [8]:
#reading data
flood_aff = pd.read_csv('../data/raw/total-affected-by-floods/affected.csv')
flood_death = pd.read_csv('../data/raw/death-rate-from-floods/death.csv')

In [6]:
flood_aff

     Country name  Year  Total number of people affected by floods per 100,000
0     Afghanistan  1954                                                NaN
1     Afghanistan  1956                                                0.0
2     Afghanistan  1963                                                0.0
3     Afghanistan  1969                                                NaN
4     Afghanistan  1971                                                NaN
...           ...   ...                                                ...
7713     Zimbabwe  2020                                                NaN
7714     Zimbabwe  2021                                                NaN
7715     Zimbabwe  2022                                                0.0
7716     Zimbabwe  2023                                                NaN
7717     Zimbabwe  2024                                                NaN

[7718 rows x 3 columns]

In [9]:
flood_death

     Country name  Year  Death rates from floods
0     Afghanistan  1954                      NaN
1     Afghanistan  1956                 0.603243
2     Afghanistan  1963                 1.114062
3     Afghanistan  1969                      NaN
4     Afghanistan  1971                      NaN
...           ...   ...                      ...
7713     Zimbabwe  2020                      NaN
7714     Zimbabwe  2021                      NaN
7715     Zimbabwe  2022                 0.000000
7716     Zimbabwe  2023                      NaN
7717     Zimbabwe  2024                      NaN

[7718 rows x 3 columns]

In [ ]:
flood_aff.rename(
    columns={
        'Country name': 'country',
        'Year': 'year',
        'Total number of people affected by floods per 100,000': 'affected'
    },
    inplace=True
)
flood_death.rename(
    columns={
        'Country name': 'country',
        'Year': 'year',
        'Death rates from floods': 'death'
    },
    inplace=True
)

0       True
1       True
2       True
3       True
4       True
        ...
7713    True
7714    True
7715    True
7716    True
7717    True
Name: year, Length: 7718, dtype: bool

In [26]:
#checking if both tables are the same or not
same_ = flood_aff['year'] == flood_death['year']
set(same_)

{True}

In [23]:
flood_df = pd.merge(flood_aff, flood_death, on=['country', 'year'])
flood_df

          country  year  affected     death
0     Afghanistan  1954       NaN       NaN
1     Afghanistan  1956       0.0  0.603243
2     Afghanistan  1963       0.0  1.114062
3     Afghanistan  1969       NaN       NaN
4     Afghanistan  1971       NaN       NaN
...           ...   ...       ...       ...
7713     Zimbabwe  2020       NaN       NaN
7714     Zimbabwe  2021       NaN       NaN
7715     Zimbabwe  2022       0.0  0.000000
7716     Zimbabwe  2023       NaN       NaN
7717     Zimbabwe  2024       NaN       NaN

[7718 rows x 4 columns]

In [ ]:
flood_df.drop